{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
        
      ],
      "responses": [
        "Hey :-)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "Loans",
      "patterns": [
        "What type of loans do you offer?",
        "What kinds of loans do you have?",
        "Do you have loans?"
      ],
      "responses": [
        "At Whence Financial Services, we offer payday soft loans and payroll deductible loans, each tailored to specific employment criteria. Our loans come in collateral-based and non-collateral-based options(you can simply pledge an assets), allowing borrowers to use assets or household items of value.",
        "Whence Financial Services provides customized payday soft loans and payroll deductible loans designed to meet specific employment criteria. Our loan options include both collateral-based and non-collateral-based choices, enabling borrowers to utilize assets or valuable household items as security."
      ]
    },
    {
      "tag": "Interest",
      "patterns": [
        "What are your interest rates?",
        "What are your charges?",
        "What are you fees?"
        
      ],
      "responses": [
        "Our loan interest rates vary based on the repayment period. If you borrow and pay back within a week, the interest is as low as fifteen percent (15%). If you repay after a week but before the due date, it's thirty percent (30%). Paying back a week before the due date is at thirty-five percent (35%), and if you repay on the exact due date, it's forty percent (40%)."
        
      ]
    },
    {
      "tag": "Amount",
      "patterns": [
        "How much can I borrow?",
        "What loan amounts do you give?",
        "What is the maximum amount you give?",
        "What is the minimum amount you give?",
        "How much do you give?"
      ],
      "responses": [
        "Our loan interest rates vary based on the repayment period. If you borrow and pay back within a week, the interest is as low as fifteen percent (15%). If you repay after a week but before the due date, it's thirty percent (30%). Paying back a week before the due date is at thirty-five percent (35%), and if you repay on the exact due date, it's forty percent (40%)."
      ]
    },
    {
      "tag": "funny",
      "patterns": [
        "Tell me a joke!",
        "Tell me something funny!",
        "Do you know a joke?"
      ],
      "responses": [
        "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
        "What did the buffalo say when his son left for college? Bison."
      ]
    },
    {
      "tag": "Time",
      "patterns": [
        "How long till a loan is given?",
        "After I apply for a loan, when do i get it?",
        "Do you give cash loans?"
      ],
      "responses": [
        "We pride ourselves on the efficiency of our loan approval process, typically taking just a few hours (usually less than 3 hours) for first-time clients, contingent upon the prompt submission of all required documents, completion of the vetting process, and verification of the client's residence distance from our office. Returning clients enjoy an even quicker process, often completed in less than five minutes.."
      ]
    },
    {
      "tag": "Application",
      "patterns": [
        "How do i apply for a loan?",
        "I want to apply for a loan, how do i go about it?",
        "Can I apply for a loan online?"
        
      ],
      "responses": [
        "To apply for a loan, you can visit any of our Whence Financial Services offices. The requirements vary based on your employment criteria. If you're a first-time applicant, kindly bring necessary documents such as recent payslips, bank statements, NRC, passport photos, and proof of residency (for public sector employees). Private sector employees need the same, plus an introductory letter from their company. Business owners can provide mobile money statements or bank statements from the past 3 months, along with ID, NRC, and passport photos. Students need to submit a copy of their ID, NRC, and collateral equivalent to the loan amount."
        
      ]
    },
    {
      "tag": "Requirements",
      "patterns": [
        "What are the requirements for loans? ",
        "Who is eligible to get a loan?",
        "Who can get a loan?"
      ],
      "responses": [
        "Public sector employees are required to provide 3 recent payslips, bank statements, NRC, passport photos, and proof of residency. Private sector employees have the same requirements plus an introductory letter from their company. Business owners can conveniently provide a mobile money statement or bank statements from the past 3 months, along with ID, NRC, and passport photos. Students need to submit a copy of their ID, NRC, and collateral equivalent to the loan amount. Our loans come in collateral-based and non-collateral-based options, allowing borrowers to use assets or household items of value. First-time applicants must visit our offices, while reloan applications can be easily processed online, streamlining the process with existing customer details in our system."
        
      ]
    },
    {
      "tag": "Procedure",
      "patterns": [
        "What is the prodecure to get a loan?",
        "What is the process of getting a loan?",
        "How do i go about getting a loan?"
      ],
      "responses": [
        "To apply for a loan, you can visit any of our Whence Financial Services offices. The requirements vary based on your employment criteria. If you're a first-time applicant, kindly bring necessary documents such as recent payslips, bank statements, NRC, passport photos, and proof of residency (for public sector employees). Private sector employees need the same, plus an introductory letter from their company. Business owners can provide mobile money statements or bank statements from the past 3 months, along with ID, NRC, and passport photos. Students need to submit a copy of their ID, NRC, and collateral equivalent to the loan amount."
        
      ]
    },
    {
      "tag": "Repossesion",
      "patterns": [
        "What happens if i fail to pay back a loan?",
        "Do you sell the collateral?"
        
      ],
      "responses": [
        "In the event of non-repayment, the collateralized assets are retrieved from the client. A grace period of 7 days is provided for the client to settle the outstanding loan. If payment remains unfulfilled within this timeframe, the secured assets are then liquidated through a transparent process."
        
      ]
    },{
      "tag": "Contact",
      "patterns": [
        "How can I contact Whence Fiancial Services?",
        "How can I contact you?",
        "What number can I call?"
      ],
      "responses": [
        "You can visit any of our branches countrywide, check out our branches section on this page to view branch loactions. You can also contact us on +260 971 089 407 or visit our Headquarters at Zimco House Building, Suites 401 & 402, 4th Floor, Chainda Place "
        
      ]
    },
    {
      "tag": "Whence",
      "patterns": [
        "What is Whence Financial Services?",
        "Who is Whence Financial Services?",
        "Who works at Whence Financial Services?"
        
      ],
      "responses": [
        "Whence Financial Services is a member of Whence Group, an indigenous company incorporated in Zambia. It serves as a platform for highly motivated and resourceful entrepreneurs from high institutions of learning and other sectors of society to merge and find innovative solutions to the world’s problems. Take a look at our about section to find out more about what we do."
        
      ]
    },
    {
      "tag": "Additional Services",
      "patterns": [
        "What services do you offer?",
        "What other services do you offer apart from loans?",
        "What other financial services do you offer?",
        "What else does this company do?"
      ],
      "responses": [
        "At Whence Financial Services, we specialize in providing various loan options to meet your financial needs. For more details about our services, we encourage you to visit the Services and About sections on our website. Alternatively, feel free to contact us directly at +260 971 089 407 for personalized assistance and additional information. We look forward to assisting you with your financial inquiries!"
        
      ]
    },
    {
      "tag": "Job",
      "patterns": [
        "Do you offer internship?",
        "Can I get a job?",
        "Where do i apply for a job?",
        "Do you have jobs?"
      ],
      "responses": [
        "You can apply for jobs at any of our Whence Financial Services branch offices. This process is based on availability/job openings, so kindly look out for advertised jobs opportunities on our social media pages !"
        
      ]
    }
    
  ]
}
